BartlomiejWos/Distance-Measurment-Using-mmWave-Radars/firmware/ti-arm-clang/studio_cli_awr2544.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AWR2544" --package "LOP" --part "Default" --context "r5fss0-0" --product "MCU_PLUS_SDK_AWR2544@09.00.00"
 * @versions {"tool":"1.17.0+3128"}
 */

/**
 * Import the modules used in this configuration.
 */
const adcbuf     = scripting.addModule("/drivers/adcbuf/adcbuf", {}, false);
const adcbuf1    = adcbuf.addInstance();
const cbuff      = scripting.addModule("/drivers/cbuff/cbuff", {}, false);
const cbuff1     = cbuff.addInstance();
const crc        = scripting.addModule("/drivers/crc/crc", {}, false);
const crc1       = crc.addInstance();
const edma       = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1      = edma.addInstance();
const edma2      = edma.addInstance();
const ipc        = scripting.addModule("/drivers/ipc/ipc");
const uart       = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1      = uart.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const mpu_armv77 = mpu_armv7.addInstance();
const mpu_armv78 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adcbuf1.$name = "CONFIG_ADCBUF0";

cbuff1.$name = "CONFIG_CBUFF0";

crc1.$name = "CONFIG_CRC0";

edma2.$name                             = "CONFIG_EDMA1";
cbuff1.edmaConfig                       = edma2;
edma2.instance                          = "EDMA_RSS_A";
edma2.edmaRmDmaCh[0].resourceType       = scripting.forceWrite("ownDmaCh");
edma2.edmaRmDmaCh[0].$name              = "CONFIG_EDMA_RM0";
edma2.edmaRmDmaCh[0].startIndex         = 0;
edma2.edmaRmDmaCh[0].endIndex           = 63;
edma2.edmaRmQdmaCh[0].$name             = "CONFIG_EDMA_RM1";
edma2.edmaRmQdmaCh[0].startIndex        = 0;
edma2.edmaRmQdmaCh[0].endIndex          = 0;
edma2.edmaRmTcc[0].$name                = "CONFIG_EDMA_RM2";
edma2.edmaRmTcc[0].startIndex           = 0;
edma2.edmaRmTcc[0].endIndex             = 63;
edma2.edmaRmParam[0].$name              = "CONFIG_EDMA_RM3";
edma2.edmaRmParam[0].startIndex         = 0;
edma2.edmaRmParam[0].endIndex           = 127;
edma2.edmaRmReservedDmaCh[0].$name      = "CONFIG_EDMA_RM4";
edma2.edmaRmReservedDmaCh[0].startIndex = 0;
edma2.edmaRmReservedDmaCh[0].endIndex   = 0;

uart1.$name           = "CONFIG_UART0";
uart1.UART.$assign    = "UARTA";
uart1.UART.RX.$assign = "PAD_DA";
uart1.UART.TX.$assign = "PAD_DB";

edma1.$name                       = "CONFIG_EDMA0";
edma1.regionId                    = 0;
uart1.edmaConfig                  = edma1;
edma1.instance                    = "EDMA_DSS_A";
edma1.enableOwnQdmaChannelConfig  = false;
edma1.enableReservedChannelConfig = false;
edma1.edmaRmDmaCh[0].resourceType = scripting.forceWrite("ownDmaCh");
edma1.edmaRmDmaCh[0].$name        = "CONFIG_EDMA_RM10";
edma1.edmaRmTcc[0].$name          = "CONFIG_EDMA_RM12";
edma1.edmaRmTcc[0].endIndex       = 63;
edma1.edmaRmParam[0].$name        = "CONFIG_EDMA_RM13";

debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;

mpu_armv72.$name = "CONFIG_MPU_REGION1";
mpu_armv72.size  = 14;

mpu_armv73.$name    = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr = 0x80000;
mpu_armv73.size     = 14;

mpu_armv74.$name    = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr = 0x10200000;
mpu_armv74.size     = 20;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x102E0000;
mpu_armv75.size         = 16;
mpu_armv75.attributes   = "NonCached";
mpu_armv75.allowExecute = false;

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr     = 0xC5000000;
mpu_armv76.attributes   = "NonCached";
mpu_armv76.allowExecute = false;
mpu_armv76.size         = 12;

mpu_armv77.$name        = "CONFIG_MPU_REGION6";
mpu_armv77.attributes   = "NonCached";
mpu_armv77.allowExecute = false;
mpu_armv77.size         = 14;
mpu_armv77.baseAddr     = 0x1021C000;

mpu_armv78.$name        = "CONFIG_MPU_REGION7";
mpu_armv78.baseAddr     = 0x88000000;
mpu_armv78.allowExecute = false;
mpu_armv78.attributes   = "NonCached";
mpu_armv78.size         = 20;
